# Parameter Type Id Mep Segment Override Property

Source: https://www.revitapidocs.com/2026/888dc013-3696-33c9-bb47-2e3790d6f3f3.htm

---

| Parameter Type Id Mep Segment Override Property |
| --- |

"Overrides"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId MepSegmentOverride { get; }
```

```
Public Shared ReadOnly Property MepSegmentOverride As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ MepSegmentOverride {
	ForgeTypeId^ get ();
}
```

```
static member MepSegmentOverride : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace